/*

function компонента для айтема (лі з текстом + кнопкою)

За натисненням на кнопку лі зникає з екрану


1. Зробити функціональну компоненту
2. Винести в цю функціональну компоненту <li>
3. Переписати логіку відмалювання лішки так, що дані будуть спускать від батька черех пропси
4. Зробити колбек в батьківського елемента, який має отримати id на вхід та видалити зі стейта елемент з таким id
5. В компоненті TodoItem зробити виклик колбека і передати йому id (за натиснення на кнопку)

*/

function TodoItem(props) {
    return (
    <li>
        {props.text}         
        <button onClick={() => {props.delCallback()}}>X</button>
    </li>
);

}

export default TodoItem;